#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.dev.data.archive_file.pubsub_function_source["channelMessage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Reading...
module.dev.data.archive_file.pubsub_function_source["channelMessage"]: Read complete after 0s [id=31b3d9977309e0c93af950be7988130ce56772d2]
module.dev.data.archive_file.pubsub_function_source["cloudErrorLog"]: Reading...
module.dev.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Read complete after 0s [id=0670e2955e9f86836446bb766bcd64a84f94db45]
module.dev.data.archive_file.pubsub_function_source["stm"]: Reading...
module.dev.data.archive_file.http_function_source["java"]: Reading...
module.dev.data.archive_file.http_function_source["hello"]: Reading...
module.dev.data.archive_file.http_function_source["merch"]: Reading...
module.dev.data.archive_file.http_function_source["answer"]: Reading...
module.dev.data.archive_file.pubsub_function_source["cloudErrorLog"]: Read complete after 0s [id=dcf87a1e3f4a3bd372e0d8d8561a7869fe761a76]
module.dev.data.archive_file.http_function_source["hello"]: Read complete after 0s [id=d3aff51c68f98c729867e28f35be543c27184d8e]
module.dev.data.archive_file.pubsub_function_source["privateMessage"]: Reading...
module.dev.data.archive_file.http_function_source["froge"]: Reading...
module.dev.data.archive_file.pubsub_function_source["stm"]: Read complete after 0s [id=0e4daeb9e2a2fc2db356eacd81a4736fd6c7a369]
module.dev.data.archive_file.http_function_source["answer"]: Read complete after 0s [id=8990ff7d100ccf1a9eefa60e2fed3d07432d19e1]
module.dev.data.archive_file.http_function_source["froge"]: Read complete after 0s [id=98990a9f59ec6a8711e7f90924fb0ce1e4b483ad]
module.dev.data.archive_file.http_function_source["merch"]: Read complete after 0s [id=df6f67767fcc0a096ae3706ad16d46535b3c7411]
module.dev.data.archive_file.http_function_source["exam"]: Reading...
module.dev.data.archive_file.http_function_source["exam"]: Read complete after 0s [id=de84a649e65565d61e8a1a7a1a7d53dff2f906e0]
module.dev.data.archive_file.pubsub_function_source["privateMessage"]: Read complete after 0s [id=491bdf46456cc08936aed69ba45234d092cfd96b]
module.dev.data.archive_file.http_function_source["help"]: Reading...
module.dev.data.archive_file.http_function_source["video"]: Reading...
module.dev.data.archive_file.http_function_source["flag"]: Reading...
module.dev.data.archive_file.http_function_source["warn"]: Reading...
module.dev.data.archive_file.http_function_source["java"]: Read complete after 0s [id=5c394ffff4f20dea8bc47029905259fa732a6a85]
module.dev.data.archive_file.http_function_source["flag"]: Read complete after 0s [id=3c324e538a1c52e11b42bf3fdd2e95c1c00a5783]
module.dev.data.archive_file.http_function_source["help"]: Read complete after 0s [id=e4f9818109e6d3c6fb840ab00b90c99a6637c51a]
module.dev.data.archive_file.http_function_source["warn"]: Read complete after 0s [id=6d3600599ea5cf1f336e9a7a28008bbdaa238df1]
module.dev.data.archive_file.http_function_source["src"]: Reading...
module.dev.data.archive_file.http_function_source["listwarn"]: Reading...
module.dev.data.archive_file.http_function_source["describe"]: Reading...
module.dev.data.archive_file.http_function_source["video"]: Read complete after 0s [id=428553a64384a42bd7c9e918bd72bb240172e07d]
module.dev.data.archive_file.pubsub_function_source["cloudDeploymentLog"]: Reading...
module.dev.data.archive_file.http_function_source["http"]: Reading...
module.dev.data.archive_file.http_function_source["src"]: Read complete after 0s [id=d283a62085b3665676857075d5397e051990724b]
module.dev.data.archive_file.pubsub_function_source["cloudDeploymentLog"]: Read complete after 0s [id=f5e0c278783c73ab95d630022ac487fe5e220188]
module.dev.data.archive_file.http_function_source["describe"]: Read complete after 0s [id=8149d3888af4d77844b83253c94a05cff143ff3f]
module.dev.data.archive_file.http_function_source["http"]: Read complete after 0s [id=c221dc2f104f758030579ea39e14ee1746c73f73]
module.dev.data.archive_file.http_function_source["listwarn"]: Read complete after 0s [id=f3c8398baba099038bc9ab7912479168c7c09a6a]
module.dev.data.archive_file.http_function_source["ban"]: Reading...
module.dev.data.archive_file.pubsub_function_source["exp"]: Reading...
module.dev.data.archive_file.pubsub_function_source["updateUserRole"]: Reading...
module.dev.data.archive_file.http_function_source["go"]: Reading...
module.dev.data.archive_file.http_function_source["leaderboard"]: Reading...
module.dev.data.archive_file.http_function_source["js"]: Reading...
module.dev.data.archive_file.http_function_source["gif"]: Reading...
module.dev.data.archive_file.http_function_source["go"]: Read complete after 0s [id=2b43ceea3bef18a296541bf1613fd465c8d8fa04]
module.dev.data.archive_file.http_function_source["gif"]: Read complete after 0s [id=ade2bf534a1bf94beac9b4924ebb04d92f75a7a3]
module.dev.data.archive_file.http_function_source["ban"]: Read complete after 0s [id=c50aab648aa613c99544b8ad8b7e19361c838e61]
module.dev.data.archive_file.pubsub_function_source["updateUserRole"]: Read complete after 0s [id=93ff48c45ffeafd96931e0b86e287b1336eeeeda]
module.dev.data.archive_file.http_function_source["js"]: Read complete after 0s [id=358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7]
module.dev.data.archive_file.http_function_source["level"]: Reading...
module.dev.data.archive_file.http_function_source["leaderboard"]: Read complete after 0s [id=d276adec74a5ac23773986b167399557ae58f455]
module.dev.data.archive_file.pubsub_function_source["exp"]: Read complete after 0s [id=bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09]
module.dev.data.archive_file.http_function_source["level"]: Read complete after 0s [id=3fcc615182fd8bdcd4ab92bb62515ef6b58a0ea6]
module.dev.google_secret_manager_secret.secret-basic["TENOR_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/TENOR_API_TOKEN]
module.dev.google_secret_manager_secret.secret-basic["YOUTUBE_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/YOUTUBE_API_TOKEN]
module.dev.google_secret_manager_secret.secret-basic["STM_API_KEY"]: Refreshing state... [id=projects/archy-f06ed/secrets/STM_API_KEY]
module.dev.google_secret_manager_secret.secret-basic["DISCORD_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/DISCORD_TOKEN]
module.dev.google_pubsub_topic.pubsub_topic["exp_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_exp_discord]
module.dev.google_logging_project_sink.cloud_function_crud_sing: Refreshing state... [id=projects/archy-f06ed/sinks/archy-cloud-function-crud-dev]
module.dev.google_storage_bucket.froge: Refreshing state... [id=froge-public-bucket-dev]
module.dev.google_pubsub_topic.pubsub_topic["channel_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_channel_message_discord]
module.dev.google_storage_bucket.function_bucket: Refreshing state... [id=archy-f06ed-function-dev]
module.dev.google_pubsub_topic.pubsub_topic["froge_of_the_day"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_froge_of_the_day]
module.dev.google_pubsub_topic.pubsub_topic["generate_welcome_image"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_generate_welcome_image]
module.dev.google_pubsub_topic.pubsub_topic["private_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_private_message_discord]
module.dev.google_pubsub_topic.pubsub_topic["update_user_role"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_update_user_role]
module.dev.google_pubsub_topic.pubsub_topic["stm_status"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_stm_status]
module.dev.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Read complete after 1s [id=f9f02508910a5e23f3b8de2947ed1f573d4ed654]
module.dev.google_pubsub_topic.pubsub_topic["cloud_function_crud_log"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_cloud_function_crud_log]
module.dev.google_pubsub_topic.pubsub_topic["cloud_function_error_log"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_cloud_function_error_log]
module.dev.google_logging_project_sink.cloud_function_error_sink: Refreshing state... [id=projects/archy-f06ed/sinks/archy-cloud-function-error-dev]
module.dev.google_storage_bucket_access_control.public_rule: Refreshing state... [id=froge-public-bucket-dev/allUsers]
module.dev.google_compute_instance.default: Refreshing state... [id=projects/archy-f06ed/zones/us-central1-a/instances/e2-micro-archy]
module.dev.google_storage_bucket_object.http_function_zip["video"]: Refreshing state... [id=archy-f06ed-function-dev-src-428553a64384a42bd7c9e918bd72bb240172e07d.zip]
module.dev.google_storage_bucket_object.http_function_zip["flag"]: Refreshing state... [id=archy-f06ed-function-dev-src-3c324e538a1c52e11b42bf3fdd2e95c1c00a5783.zip]
module.dev.google_storage_bucket_object.http_function_zip["level"]: Refreshing state... [id=archy-f06ed-function-dev-src-3fcc615182fd8bdcd4ab92bb62515ef6b58a0ea6.zip]
module.dev.google_storage_bucket_object.http_function_zip["js"]: Refreshing state... [id=archy-f06ed-function-dev-src-358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7.zip]
module.dev.google_storage_bucket_object.http_function_zip["leaderboard"]: Refreshing state... [id=archy-f06ed-function-dev-src-d276adec74a5ac23773986b167399557ae58f455.zip]
module.dev.google_storage_bucket_object.http_function_zip["java"]: Refreshing state... [id=archy-f06ed-function-dev-src-5c394ffff4f20dea8bc47029905259fa732a6a85.zip]
module.dev.google_storage_bucket_object.http_function_zip["froge"]: Refreshing state... [id=archy-f06ed-function-dev-src-98990a9f59ec6a8711e7f90924fb0ce1e4b483ad.zip]
module.dev.google_storage_bucket_object.http_function_zip["src"]: Refreshing state... [id=archy-f06ed-function-dev-src-d283a62085b3665676857075d5397e051990724b.zip]
module.dev.google_storage_bucket_object.http_function_zip["go"]: Refreshing state... [id=archy-f06ed-function-dev-src-2b43ceea3bef18a296541bf1613fd465c8d8fa04.zip]
module.dev.google_storage_bucket_object.http_function_zip["gif"]: Refreshing state... [id=archy-f06ed-function-dev-src-ade2bf534a1bf94beac9b4924ebb04d92f75a7a3.zip]
module.dev.google_storage_bucket_object.http_function_zip["ban"]: Refreshing state... [id=archy-f06ed-function-dev-src-c50aab648aa613c99544b8ad8b7e19361c838e61.zip]
module.dev.google_storage_bucket_object.http_function_zip["http"]: Refreshing state... [id=archy-f06ed-function-dev-src-c221dc2f104f758030579ea39e14ee1746c73f73.zip]
module.dev.google_storage_bucket_object.http_function_zip["warn"]: Refreshing state... [id=archy-f06ed-function-dev-src-6d3600599ea5cf1f336e9a7a28008bbdaa238df1.zip]
module.dev.google_storage_bucket_object.http_function_zip["hello"]: Refreshing state... [id=archy-f06ed-function-dev-src-d3aff51c68f98c729867e28f35be543c27184d8e.zip]
module.dev.google_storage_bucket_object.http_function_zip["merch"]: Refreshing state... [id=archy-f06ed-function-dev-src-df6f67767fcc0a096ae3706ad16d46535b3c7411.zip]
module.dev.google_storage_bucket_object.http_function_zip["answer"]: Refreshing state... [id=archy-f06ed-function-dev-src-8990ff7d100ccf1a9eefa60e2fed3d07432d19e1.zip]
module.dev.google_storage_bucket_object.http_function_zip["help"]: Refreshing state... [id=archy-f06ed-function-dev-src-e4f9818109e6d3c6fb840ab00b90c99a6637c51a.zip]
module.dev.google_storage_bucket_object.http_function_zip["exam"]: Refreshing state... [id=archy-f06ed-function-dev-src-de84a649e65565d61e8a1a7a1a7d53dff2f906e0.zip]
module.dev.google_storage_bucket_object.http_function_zip["describe"]: Refreshing state... [id=archy-f06ed-function-dev-src-8149d3888af4d77844b83253c94a05cff143ff3f.zip]
module.dev.google_storage_bucket_object.http_function_zip["listwarn"]: Refreshing state... [id=archy-f06ed-function-dev-src-f3c8398baba099038bc9ab7912479168c7c09a6a.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["cloudErrorLog"]: Refreshing state... [id=archy-f06ed-function-dev-src-dcf87a1e3f4a3bd372e0d8d8561a7869fe761a76.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["stm"]: Refreshing state... [id=archy-f06ed-function-dev-src-0e4daeb9e2a2fc2db356eacd81a4736fd6c7a369.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["exp"]: Refreshing state... [id=archy-f06ed-function-dev-src-bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["cloudDeploymentLog"]: Refreshing state... [id=archy-f06ed-function-dev-src-f5e0c278783c73ab95d630022ac487fe5e220188.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["updateUserRole"]: Refreshing state... [id=archy-f06ed-function-dev-src-93ff48c45ffeafd96931e0b86e287b1336eeeeda.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["channelMessage"]: Refreshing state... [id=archy-f06ed-function-dev-src-31b3d9977309e0c93af950be7988130ce56772d2.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["generateWelcomeImage"]: Refreshing state... [id=archy-f06ed-function-dev-src-0670e2955e9f86836446bb766bcd64a84f94db45.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["privateMessage"]: Refreshing state... [id=archy-f06ed-function-dev-src-491bdf46456cc08936aed69ba45234d092cfd96b.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["frogeOfTheDay"]: Refreshing state... [id=archy-f06ed-function-dev-src-f9f02508910a5e23f3b8de2947ed1f573d4ed654.zip]
module.dev.google_cloudfunctions_function.http_function["hello"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_hello]
module.dev.google_cloudfunctions_function.http_function["level"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_level]
module.dev.google_cloudfunctions_function.http_function["merch"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_merch]
module.dev.google_cloudfunctions_function.http_function["video"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_video]
module.dev.google_cloudfunctions_function.http_function["flag"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_flag]
module.dev.google_cloudfunctions_function.http_function["exam"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_exam]
module.dev.google_cloudfunctions_function.http_function["answer"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_answer]
module.dev.google_cloudfunctions_function.http_function["java"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_java]
module.dev.google_cloudfunctions_function.http_function["js"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_js]
module.dev.google_cloudfunctions_function.http_function["listwarn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_listwarn]
module.dev.google_cloudfunctions_function.http_function["src"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_src]
module.dev.google_cloudfunctions_function.http_function["gif"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_gif]
module.dev.google_cloudfunctions_function.http_function["warn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_warn]
module.dev.google_cloudfunctions_function.http_function["froge"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_froge]
module.dev.google_cloudfunctions_function.http_function["leaderboard"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_leaderboard]
module.dev.google_cloudfunctions_function.http_function["go"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_go]
module.dev.google_cloudfunctions_function.http_function["ban"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_ban]
module.dev.google_cloudfunctions_function.http_function["describe"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_describe]
module.dev.google_cloudfunctions_function.http_function["http"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_http]
module.dev.google_cloudfunctions_function.http_function["help"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_help]
module.dev.google_cloudfunctions_function.pubsub_function["privateMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_privateMessage]
module.dev.google_cloudfunctions_function.pubsub_function["channelMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_channelMessage]
module.dev.google_cloudfunctions_function.pubsub_function["generateWelcomeImage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_generateWelcomeImage]
module.dev.google_cloudfunctions_function.pubsub_function["cloudErrorLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_cloudErrorLog]
module.dev.google_cloudfunctions_function.pubsub_function["stm"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_stm]
module.dev.google_cloudfunctions_function.pubsub_function["cloudDeploymentLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_cloudDeploymentLog]
module.dev.google_cloudfunctions_function.pubsub_function["updateUserRole"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_updateUserRole]
module.dev.google_cloudfunctions_function.pubsub_function["frogeOfTheDay"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_frogeOfTheDay]
module.dev.google_cloudfunctions_function.pubsub_function["exp"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_exp]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.dev.google_compute_instance.default will be updated in-place
  ~ resource "google_compute_instance" "default" {
        id                        = "projects/archy-f06ed/zones/us-central1-a/instances/e2-micro-archy"
      ~ metadata                  = {
          - "google-monitoring-enabled" = "true" -> null
            # (2 unchanged elements hidden)
        }
        name                      = "e2-micro-archy"
        tags                      = []
      ~ terraform_labels          = {
          + "container-vm" = "cos-stable-97-16919-29-21"
        }
        # (18 unchanged attributes hidden)

      - timeouts {}

        # (5 unchanged blocks hidden)
    }

  # module.dev.google_secret_manager_secret.secret["DISCORD_TOKEN"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "archy-f06ed"
      + secret_id             = "DISCORD_TOKEN"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # module.dev.google_secret_manager_secret.secret["STM_API_KEY"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "archy-f06ed"
      + secret_id             = "STM_API_KEY"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # module.dev.google_secret_manager_secret.secret["TENOR_API_TOKEN"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "archy-f06ed"
      + secret_id             = "TENOR_API_TOKEN"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # module.dev.google_secret_manager_secret.secret["YOUTUBE_API_TOKEN"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "archy-f06ed"
      + secret_id             = "YOUTUBE_API_TOKEN"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # module.dev.google_secret_manager_secret.secret-basic["DISCORD_TOKEN"] will be destroyed
  # (because google_secret_manager_secret.secret-basic is not in configuration)
  - resource "google_secret_manager_secret" "secret-basic" {
      - annotations           = {} -> null
      - create_time           = "2022-11-17T23:10:30.051534Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/archy-f06ed/secrets/DISCORD_TOKEN" -> null
      - labels                = {} -> null
      - name                  = "projects/763564183085/secrets/DISCORD_TOKEN" -> null
      - project               = "archy-f06ed" -> null
      - secret_id             = "DISCORD_TOKEN" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }

      - timeouts {}
    }

  # module.dev.google_secret_manager_secret.secret-basic["STM_API_KEY"] will be destroyed
  # (because google_secret_manager_secret.secret-basic is not in configuration)
  - resource "google_secret_manager_secret" "secret-basic" {
      - annotations           = {} -> null
      - create_time           = "2023-01-17T22:11:21.722366Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/archy-f06ed/secrets/STM_API_KEY" -> null
      - labels                = {} -> null
      - name                  = "projects/763564183085/secrets/STM_API_KEY" -> null
      - project               = "archy-f06ed" -> null
      - secret_id             = "STM_API_KEY" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # module.dev.google_secret_manager_secret.secret-basic["TENOR_API_TOKEN"] will be destroyed
  # (because google_secret_manager_secret.secret-basic is not in configuration)
  - resource "google_secret_manager_secret" "secret-basic" {
      - annotations           = {} -> null
      - create_time           = "2022-11-17T23:10:28.920643Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/archy-f06ed/secrets/TENOR_API_TOKEN" -> null
      - labels                = {} -> null
      - name                  = "projects/763564183085/secrets/TENOR_API_TOKEN" -> null
      - project               = "archy-f06ed" -> null
      - secret_id             = "TENOR_API_TOKEN" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }

      - timeouts {}
    }

  # module.dev.google_secret_manager_secret.secret-basic["YOUTUBE_API_TOKEN"] will be destroyed
  # (because google_secret_manager_secret.secret-basic is not in configuration)
  - resource "google_secret_manager_secret" "secret-basic" {
      - annotations           = {} -> null
      - create_time           = "2022-11-17T22:53:18.875403Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/archy-f06ed/secrets/YOUTUBE_API_TOKEN" -> null
      - labels                = {} -> null
      - name                  = "projects/763564183085/secrets/YOUTUBE_API_TOKEN" -> null
      - project               = "archy-f06ed" -> null
      - secret_id             = "YOUTUBE_API_TOKEN" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

Plan: 4 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ArmandBriere, Action: `pull_request`, Workflow: `Terraform plan`*